#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../theme.css">

#+NAME: add-bars
#+BEGIN_SRC emacs-lisp :exports none :results output
  (load-file "../bars.el")
#+END_SRC
#+CALL: add-bars()

#+OPTIONS: ^:nil

#+TITLE: Get all the pairwise comparisons in a data set

#+NAME: data
| trial | group | n |  N |
|-------+-------+---+----|
|     1 | b     | 3 |  9 |
|     1 | a     | 4 | 10 |
|     1 | c     | 5 | 10 |
|     1 | d     | 7 | 13 |
|     2 | a     | 8 | 15 |
|     2 | b     | 9 | 50 |
|     2 | c     | 4 |  7 |
|     3 | a     | 9 | 50 |



#+BEGIN_SRC R :var df=data :colnames yes :exports both
  pairwise <- function(df, trial, group) {

    work <- function(df, trial, group) {

      if (nrow(df) > 1) {
        combns <- expand.grid(as.numeric(factor(df[[group]])), as.numeric(factor(df[[group]])))
        combns <- t(apply(combns, 1, sort)) # sort rows so the order is consistent
        combns <- combns[!duplicated(combns), ]
        combns <- combns[combns[,1] != combns[, 2], , drop=FALSE]
      } else {
        #combns <- matrix(c(1, 1), nrow=1) # if you want to compare group 1 to itself
        return(NULL)
      }

      df1 <- df[combns[, 1], ]
      colnames(df1)[colnames(df1) != trial] <- paste0(colnames(df1)[colnames(df1) != trial], "_1")
      df1$key <- 1:nrow(df1)

      df2 <- df[combns[, 2], ]
      colnames(df2)[colnames(df2) != trial] <- paste0(colnames(df2)[colnames(df2) != trial], "_2")
      df2$key <- 1:nrow(df2)

      output <- merge(df1, df2, by=c("key", trial))
      output$key <- NULL

      output
    }

    do.call(rbind, lapply(split(df, df[, trial]),
                          function(x) work(x[order(x[, group]), ], trial, group)))
  }

  pairwise(df, "trial", "group")
#+END_SRC

#+RESULTS:
| trial | group_1 | n_1 | N_1 | group_2 | n_2 | N_2 |
|-------+---------+-----+-----+---------+-----+-----|
|     1 | a       |   4 |  10 | b       |   3 |   9 |
|     1 | a       |   4 |  10 | c       |   5 |  10 |
|     1 | a       |   4 |  10 | d       |   7 |  13 |
|     1 | b       |   3 |   9 | c       |   5 |  10 |
|     1 | b       |   3 |   9 | d       |   7 |  13 |
|     1 | c       |   5 |  10 | d       |   7 |  13 |
|     2 | a       |   8 |  15 | b       |   9 |  50 |
|     2 | a       |   8 |  15 | c       |   4 |   7 |
|     2 | b       |   9 |  50 | c       |   4 |   7 |
